Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/main.c
  /* Step 1b: Register buses with manager (before tasks need them) */
  {
    extern rx_bus_manager_t g_bus_manager;

    /* Register i2c0 (SMBus) - BQ4050 Battery Management System */
    err = rx_bus_config_init_smbus(&s_i2c0_config,
                                   "i2c0",                 /* name */
                                   k_riic_channel_1,       /* channel = RIIC1 */
                                   k_bq4050_i2c_addr,      /* device_addr = BQ4050 @ 0x0B */
                                   k_rx_p2_0,              /* sda_pin = P20 */
                                   k_rx_p2_1,              /* scl_pin = P21 */
                                   k_i2c_frequency_100khz, /* frequency_hz = 100 kHz */
                                   true);                  /* use_pec = true */
    RX_ASSERT(err == k_rx_ok, "i2c0 config init must succeed");
    err = rx_bus_manager_add_bus(&g_bus_manager, &s_i2c0_config);
    RX_ASSERT(err == k_rx_ok, "i2c0 registration must succeed");

    /* Register onewire0 - DS18B20 Temperature Sensor */
    err = rx_bus_config_init_onewire(&s_onewire0_config,
                                     "onewire0", /* name */
                                     k_rx_p5_1); /* pin = P51 */
    RX_ASSERT(err == k_rx_ok, "onewire0 config init must succeed");
    err = rx_bus_manager_add_bus(&g_bus_manager, &s_onewire0_config);
    RX_ASSERT(err == k_rx_ok, "onewire0 registration must succeed");

    /* Register gpio - Generic GPIO Access (initial pin P00) */
    err = rx_bus_config_init_gpio(&s_gpio_config,
                                  "gpio",     /* name */
                                  k_rx_p0_0); /* pin = P00 (generic bus) */
    RX_ASSERT(err == k_rx_ok, "gpio config init must succeed");
    err = rx_bus_manager_add_bus(&g_bus_manager, &s_gpio_config);
    RX_ASSERT(err == k_rx_ok, "gpio registration must succeed");

    /* Register adc0 - Motor Current Sensing (ADC Unit 0) */
    err = rx_bus_config_init_adc(&s_adc0_config,
                                 "adc0",                  /* name */
                                 k_adc_unit_0,            /* unit = ADC0 (S12AD0) */
                                 k_adc_channel_0,         /* channel = 0 (generic bus) */
                                 k_adc_resolution_12bit); /* bits = 12-bit resolution */
    RX_ASSERT(err == k_rx_ok, "adc0 config init must succeed");
    err = rx_bus_manager_add_bus(&g_bus_manager, &s_adc0_config);
    RX_ASSERT(err == k_rx_ok, "adc0 registration must succeed");
  }

  /* Step 1c: Initialize shared data module (mutexes, event flags) */
  err = shared_data_init();
  RX_ASSERT(err == k_rx_ok, "shared_data_init must succeed");

  /* Step 2: Create tasks (lowest priority first) */

  /* Telemetry Task - Priority 18 (lowest) */
  err = telemetry_task_create();
  RX_ASSERT(err == k_rx_ok, "telemetry_task_create must succeed");

  /* LED Status Task - Priority 17 (visual feedback) */
  err = led_status_task_create();
  RX_ASSERT(err == k_rx_ok, "led_status_task_create must succeed");

  /* BMS Monitor Task - Priority 15 */
  err = bms_monitor_task_create();
  RX_ASSERT(err == k_rx_ok, "bms_monitor_task_create must succeed");

  /* Temperature Sensor Task - Priority 15 */
  err = temp_sensor_task_create();
  RX_ASSERT(err == k_rx_ok, "temp_sensor_task_create must succeed");

  /* Obstacle Detection Task - Priority 12 */
  err = obstacle_detect_task_create();
  RX_ASSERT(err == k_rx_ok, "obstacle_detect_task_create must succeed");

  /* Motor Control Task - Priority 8 */
  err = motor_control_task_create();
  RX_ASSERT(err == k_rx_ok, "motor_control_task_create must succeed");

  /* Communication Task - Priority 5 (highest) */
  err = comm_task_create();
  RX_ASSERT(err == k_rx_ok, "comm_task_create must succeed");

  /* Postcondition: All tasks created successfully */
  RX_ASSERT(err == k_rx_ok, "Postcondition: All tasks must be created successfully");
}

/**
 * @brief Main entry point for STAR RX72N motor controller firmware
 *
 * @details
 * Implements the **three-stage bootstrap sequence** for the embedded system:
 *
 * 1. **Stage 1: Startup Validation** (~10 µs)
 *    - Read reset status registers (RSTSR0, RSTSR1, RSTSR2)
 *    - Detect abnormal reset conditions (watchdog timeout, brownout, etc.)
 *    - Assert-halt on critical flags (IWDTRF = firmware bug)
 *
 * 2. **Stage 2: System Initialization** (~250 µs)
 *    - Configure PLL for 240 MHz operation (rx_clock_power_init)
 *    - Initialize UART for early error logging (uart_debug_init)
 *    - Report startup flags to console (internal_report_startup_flags)
 *    - Initialize infrastructure (error handler, pin validator) (rx_infrastructure_init)
 *    - Initialize hardware (motor drivers, encoders, USB CDC) (hardware_init)
 *
 * 3. **Stage 3: ThreadX Bootstrap** (never returns)
 *    - Call tx_kernel_enter() to start RTOS scheduler
 *    - ThreadX calls tx_application_define() callback
 *    - Application threads created (app_main_task for PID control)
 *
 * ## Execution Flow Diagram
 *
 * @msc
 * msc {
 *   width=800;
 *   Main, ClockInit, HardwareInit, ThreadX, AppTask;
 *
 *   Main => Main [label="internal_check_startup_flags()", textcolor="blue"];
 *   Main note Main [label="Validate PORF, IWDTRF, WDTRF, SWRF, LVD0RF", textcolor="blue"];
 *   Main => ClockInit [label="rx_clock_power_init()", textcolor="green"];
 *   ClockInit => ClockInit [label="Configure PLL (240 MHz)", textcolor="green"];
 *   ClockInit => Main [label="k_rx_ok", textcolor="green"];
 *   Main => HardwareInit [label="hardware_init()", textcolor="green"];
 *   HardwareInit => HardwareInit [label="Motor drivers\nUSB CDC\nSensors", textcolor="green"];
 *   HardwareInit => Main [label="k_rx_ok", textcolor="green"];
 *   Main => ThreadX [label="tx_kernel_enter()", textcolor="purple"];
 *   ThreadX => ThreadX [label="Start scheduler\n(NEVER RETURNS)", textcolor="purple"];
 *   ThreadX => AppTask [label="tx_application_define()\napp_main_task_create()", textcolor="purple"];
 *   AppTask => AppTask [label="PID control @ 100 Hz\nUSB communication", textcolor="purple"];
 * }
 * @endmsc
 *
 * ## Performance Characteristics (RX72N @ 240 MHz)
 *
 * | Phase | Execution Time | CPU Cycles | Notes |
 * |-------|----------------|------------|-------|
 * | **C runtime init** | ~500 µs | ~120,000 | crt0.S: BSS clear, data copy |
 * | **Startup flag checks** | ~10 µs | ~2,400 | 6 register reads + validation |
 * | **Clock init (PLL lock)** | ~200 µs | ~48,000 | PLL stabilization wait |
 * | **Hardware init** | ~50 ms | ~12M | USB enumeration dominates |
 * | **ThreadX start** | ~100 µs | ~24,000 | Kernel object creation |
 * | **Total boot time** | **~51 ms** | **~12.2M** | Ready for first control loop |
 *
 * ## Memory Usage (Static Allocation Only - No Heap)
 *
 * | Object | Size | Location | Purpose |
 * |--------|------|----------|---------|
 * | **Main stack** | 4 KB | SRAM | Pre-ThreadX execution |
 * | **App main task stack** | 8 KB | SRAM | PID control, USB comm |
 * | **ThreadX kernel objects** | ~2 KB | SRAM | TCBs, timers, semaphores |
 * | **USB buffers** | 2 KB | SRAM | CDC ring buffers (TX/RX) |
 *
 * **Total SRAM usage:** ~16 KB / 512 KB (3% utilization)
 *
 * ## Error Handling and Recovery
 *
 * **Critical errors (assert-halt):**
 * - IWDTRF set -> Prior execution timed out (firmware bug)
 * - Register pointer NULL -> Hardware access violation
 * - ThreadX thread creation failed -> Memory exhaustion
 *
 * **Non-critical errors (return error code):**
 * - WDTRF/SWRF/LVD0RF set -> Log and return k_rx_err_hw_init_failed
 * - Clock init failed -> Log and return error code
 * - Hardware init failed -> Log and return error code
 *
 * **Recovery strategy:**
 * - On assert: Halt execution with message (wait loop)
 * - On error return: Caller (none for main) would handle, but main has no caller
 * - Final fallback: Infinite wait loop at end of main() (unreachable)
 *
 * ## UART Failure Handling
 *
 * If **uart_debug_init()** fails (extremely rare - hardware fault):
 * - System attempts to log error via internal_rx_fatal_error()
 * - UART functions fail silently by design (see uart.c line 1273 comment)
 * - internal_report_startup_flags() skipped (conditional: only if UART succeeded)
 * - System halts in infinite while(1) loop
 * - **No console output available**
 *
 * **Debugging UART Failure:**
 * - Use hardware debugger (e² studio debugger, OpenOCD, J-Link, GDB)
 * - Check SCI9 clock enable (MSTPCRB bit 22 must be clear)
 * - Verify GPIO pin configuration (P2.6/TXD9, P2.7/RXD9 in peripheral mode)
 * - Confirm crystal oscillator stable (UART requires PCLKB = 60 MHz)
 * - Check baud rate calculation (should be 115200 @ PCLKB=60MHz)
 *
 * **Likelihood:** <0.01% (requires hardware fault, incorrect clock config, or GPIO misconfiguration)
 *
 * @return k_main_ret_success Nominal return value (never reached)
 * @retval k_main_ret_success ThreadX scheduler started successfully (unreachable code path)
 *
 * @pre MCU hardware reset completed (power-on, watchdog, or software reset)
 * @pre C runtime initialized (BSS cleared, data section copied to RAM)
 * @pre Stack pointer set to valid SRAM address (linker script configuration)
 * @pre Interrupt vector table configured (reset vector points to main)
 *
 * @post System clocks configured (ICLK=240 MHz, PCLKA=120 MHz, PCLKB=60 MHz)
 * @post All hardware peripherals initialized (motors, USB, sensors)
 * @post ThreadX RTOS scheduler running (main thread: app_main_task)
 * @post Function never returns (tx_kernel_enter() takes over execution)
 *
 * @note **This function executes in privileged mode with interrupts disabled** until
 *       ThreadX starts. Hardware interrupts (USB, timers) only active after scheduler starts.
 *
 * @warning **Never call main() from application code.** This is the reset vector entry point only.
 *
 * @warning **Never return from main().** ThreadX scheduler must take over. If execution reaches
 *          the end of main(), the system is in an undefined state.
 *
 * @par Thread Safety:
 * Not applicable - executes in single-threaded context before ThreadX starts.
 *
 * @par Example Boot Sequence:
 * @code
 * // Step 1: Hardware reset (power-on)
 * // Step 2: C runtime init (crt0.S)
 * // Step 3: main() called
 *
 * int main(void) {
 *   // Stage 1: Validate reset cause
 *   rx_err_t ret = internal_check_startup_flags();
 *   if (ret != k_rx_ok) {
 *     // Critical error: halt execution
 *     while (1) { __asm__ volatile("wait"); }
 *   }
 *
 *   // Stage 2: Initialize clocks (240 MHz PLL)
 *   ret = rx_clock_power_init();
 *   if (ret != k_rx_ok) {
 *     // Clock init failed: halt execution
 *     while (1) { __asm__ volatile("wait"); }
 *   }
 *
 *   // Stage 2.5: Initialize UART for early error logging
 *   ret = uart_debug_init();
 *   if (ret == k_rx_ok) {
 *     internal_report_startup_flags();  // Report boot diagnostics
 *   }
 *   // Check UART status (halt if failed, but at least tried to report)
 *   if (ret != k_rx_ok) {
 *     while (1) { __asm__ volatile("wait"); }
 *   }
 *
 *   // Stage 3: Initialize hardware (motors, USB, sensors)
 *   ret = hardware_init();
 *   if (ret != k_rx_ok) {
 *     // Hardware init failed: halt execution
 *     while (1) { __asm__ volatile("wait"); }
 *   }
 *
 *   // Stage 4: Start ThreadX RTOS (NEVER RETURNS)
 *   tx_kernel_enter();
 *
 *   // Unreachable code: scheduler failed to start
 *   while (1) { __asm__ volatile("wait"); }
 *   __builtin_unreachable();
 * }
 * @endcode
 *
 * @see internal_check_startup_flags() Validate reset status registers
 * @see rx_clock_power_init() Configure system clocks (240 MHz PLL)
 * @see hardware_init() Initialize motor drivers, USB CDC, sensors
 * @see tx_kernel_enter() Start ThreadX RTOS scheduler (never returns)
 * @see tx_application_define() ThreadX callback to create application threads
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify boot sequence and error handling paths
 */
int main(void)
{
  rx_err_t ret;

  /* Check startup flags (via internal_check_startup_flags):
   *  PORF (Power-On Reset Detect Flag) - asserted, halts on failure
   *  IWDTRF (Independent Watchdog Timer Reset Detect Flag) - asserted, halts on failure
   *  WDTRF (Watchdog Timer Reset Detect Flag)
   *  SWRF (Software Reset Detect Flag)
   *  LVD0RF (Voltage-Monitoring 0 Reset Detect Flag)
   *  CWSF (Cold/Warm Start Determination Flag)
   */
  ret = internal_check_startup_flags();
  RX_ERROR_CHECK(ret); /* If this fails, errors cant be logged */

  /* Initialize system clocks and power management */
  ret = rx_clock_power_init();
  RX_ERROR_CHECK(ret); /* If this fails, errors cant be logged */

  /* ========================================================================
   * EARLY UART INITIALIZATION - Enable error logging ASAP
   * ======================================================================== */
  ret = uart_debug_init();

  /* Report startup flags to console (only if UART initialized successfully) */
  if (ret == k_rx_ok) {
    internal_report_startup_flags();
  }

  /* Now check UART init status - will halt if failed, but at least tried to report flags */
  RX_ERROR_CHECK(ret);

  /* Initialize infrastructure (error handler + pin validator) before peripherals.
   * Must run in single-threaded context before ThreadX starts. */
  ret = rx_infrastructure_init();
  RX_ERROR_CHECK(ret);

  /* Initialize application-specific hardware (GPIO, GPTW, timers, UART, SPI, I2C, ADC) */
  ret = hardware_init();
  RX_ERROR_CHECK(ret);

  /* Start the ThreadX scheduler - should never return */
  tx_kernel_enter();

  /* Should never reach here, ThreadX scheduler failed to start if it does */
  while (1) {
    __asm__ volatile("wait"); /* Wait for sleep/idle */
  }

  /* Unreachable: ThreadX scheduler takes over before reaching this point.
   * If execution reaches here, the system is in an undefined state. */
  __builtin_unreachable();

  return k_main_ret_success;
}
